//1) Напиши функцію отриманняКрайовихЕлементів(масив), яка приймає один параметр - масив елементів будь-якої довжини. Функція повинна повертати масив із двох елементів - першого та останнього елемента параметра масив.

//
// 2)Напиши функцію includes(масив, значення), яка виконує те саме, що і метод масиву масив.includes(значення) - перевіряє, чи є у масиві масив значення value, повертаючи true, якщо таке значення є, та false у протилежному випадку.

// При виконанні цього завдання в тілі функції includes() не можна використовувати метод масиву includes(значення).

// Виклик includes([10, 20, 30, 40, 50], 30) повертає true.
// Виклик includes([10, 20, 30, 40, 50], 17) повертає false.
