// що таке функція?
// Область бачення?
// Стек викликів

// function = ключове слово для утворення функції
// Назва функції (Вимоги: латинський алфавіт, camelCase, давати змістовні назви.)
//() = в них ми передаємо параметри функції  (Магія)
// {} = тіло функції(Виконується при виклику функції)

// Виклик функції
// передаємо параметри функції

// Параметри функції = це те що ми записуєм у круглих дужках після назви
//Ці змінні доступні  тільки у тілі функції
//якщо параметрів більше ніж один то ми записуєм їх по черзі через кому
// Всі параметри присвоюються по черзі
function doCoffee(milk, sirop) {
  console.log("milk , " + milk);
  console.log("Sirop , " + sirop);

  if (!milk && !sirop) {
    console.log("Я роблю звичайну каву");
  }
  if (milk && !sirop) {
    console.log("Я роблю  каву з молоком");
  }
  if (!milk && sirop) {
    console.log("Я роблю  каву з cиропом");
  }
  if (milk && sirop) {
    console.log("Я роблю  каву з cиропом та з молоком");
  }
}

function goWalk() {}
// const arrowFunc = () => {};
const element = document.getElementById("start");

// doCoffee("milk");
// doCoffee() = виклик функції doCoffee
// doCoffee("milk") = "milk" = При виклику функції ми можемо передати перелік данних які необхідні функції для роботи(Аргументи)

element.addEventListener(
  "click",
  doCoffee("sirop", "другий", "трейтій", "четвертий")
);
