// 1)Напиши скрипт який при кліку на кнопку буде виводити на екран повідомлення “Hello World!”. Використовуй колбек в вигляді стрілки

// => - має вмонтований ретурн

// ...rest та spread оператор
//rest - зібрати всі елементи в один масив
// spread - роспилити всі елементи,отримуємо масив по одному елементу

const n = [1, 2, 3];
// нашо копіювати масиви?
// Щоб зберігати початкові данні які ви отримали з бази данних неушкодженими
const c = [...n];
c.pop();
c.push(3);
console.log(c);
console.log(n);
const getSum = (a, b, ...arg) => {
  // якщо ви передаєте масив ...spread роспиляє по одному елементу масива
  // якщо вам передали елементи по одному і вам треба їх зібрати в один масив ...rest оператор він збирає всі елементи,що залишились в масив
  console.log(arg);
  // let result = 0;
  // for (const num of arg) {
  //   result += num;
  // }
  // return result;
};

function getSumm(a, b, c) {
  // локальна змінна  arguments яка існує тільки в function declatarion (у функціях які ви створили через ключове слово function)
  console.log(arguments);
  return a + b + c;
}

getSumm(1, 2, 3);
// Функція яка нічого не повертає з свого тіла, повертає завжди undefined

console.log(getSum(1, 2, 3, 4, 5, 6, 7, 2, 8, 98, 9));
// 2)Створіть програму, яка генерує випадкове число від 1 до 100. Користувач повинен вгадати число, введенням його в текстове поле. При кліку на кнопку "Перевірити" програма повинна повідомити користувача, чи є їх відповідь правильною.(Розмітка у index.js)

// 3)Створіть програму, яка відображає повідомлення про те, скільки разів користувач клікнув на сторінці.

// 4)Напишіть функцію, яка приймає масив чисел і колбек-функцію. Функція повинна застосовувати колбек-функцію до кожного елементу масиву та повертати новий масив, що містить результати застосування колбек-функції до кожного елементу.

const applyCallbackToEachElement = (arr, callback) => {};

const arr = [1, 2, 3, 4, 5];
// const squareCallback = ;

const result = applyCallbackToEachElement(arr, squareCallback);
console.log(result); // [1, 4, 9, 16, 25]

// 5)Розрахунок дисконтної ціни
//Створіть функцію, яка розраховує дисконтну ціну на товар з урахуванням знижки. Функція повинна приймати вартість товару та відсоток знижки як аргументи. Використайте стрілкову функцію та колбек.

const calculateDiscountedPrice = (price, discount, callback) => {};

// const showDiscountedPrice = ;

calculateDiscountedPrice(100, 10, showDiscountedPrice); // Discounted price: 90
