// Написати скрипт відкриття та закриття модального вікна по кнопці.(task1)

//Використовуючи  код у файлі task1 написати скрипт закриття модального вікна по кліку на бекдроп(task1)

// Напиши скрипт в якому є три радіобатони зі значенями кольрів. При обиранні  будь якого колір фону боді змінюється відповідно(task2 задача 3)

// Напиши скрипт який, при наборі тексту в інпут input#name-input (подія input), підставляє його поточне значення в span#name-output. якщо інпут порожній, в спані повинен відображатися рядок 'незнайомець'.(task2 задача 4)

// Напиши скрипт, який би при втраті фокуса на інпут, перевіряв його вміст на правильну кількість символів(файл task2 задача 5)
// Скільки символів має бути в інпут, вказується в його атрибуті data-length.
// Якщо введена відповідна кількість, то border інпут стає зеленим,   якщо неправильне — червоним.
// Для додавання стилів, використовуй CSS-класи valid і invalid.
// #va]lidation-input {
//   border: 3px solid #bdbdbd;
// }
// #validation-input.valid {
//   border-color: #4caf50;
// }
// #validation-input.invalid {
//   border-color: #f44336;
// }

//Напиши скрипт, який реагує на зміну значення input#font-size-control (подія input) і змінює інлайн-стиль span#text оновлюючи властивість font-size. В результаті при перетягуванні повзунка змінюватиметься розмір тексту.(task2  задача 6)
